{
    "courses": [
      {
        "id": 1,
        "title": "Mastering Node.js",
        "instructor": "John Doe",
        "description": "Learn to build scalable network applications using Node.js",
        "details":"Building scalable network applications using Node.js involves leveraging the asynchronous, event-driven nature of Node.js to create high-performance, non-blocking applications capable of handling large numbers of concurrent connections. Node.js, with its JavaScript runtime built on Chrome's V8 engine, is particularly well-suited for this task due to its lightweight, efficient design. Scalability in this context refers to the ability of an application to gracefully handle increased loads by efficiently utilizing resources such as CPU, memory, and network bandwidth without compromising performance or stability. To achieve this, developers utilize various techniques such as clustering, load balancing, and asynchronous programming patterns like callbacks, Promises, and async/await. Node.js also offers a rich ecosystem of modules and libraries, including Express.js for building web servers, Socket.io for real-time communication, and PM2 for process management, which further enhance the scalability and robustness of network applications. Additionally, developers can leverage modern JavaScript features such as ES6 syntax and modules to write clean, maintainable code. By mastering these concepts and tools, developers can effectively build scalable network applications using Node.js that are capable of meeting the demands of modern web services and applications.",
        "price": 49.99,
        "duration": "6 weeks",
        "level": "Intermediate",
        "category": "Backend Development",
        "image": "https://miro.medium.com/v2/resize:fit:1358/1*yC7diwt_CVGuekFAenljwA.png"
      },
      {
        "id": 2,
        "title": "Python Web Development with Django",
        "instructor": "Jane Smith",
        "description": "Build web applications with Python using the Django framework",
        "details":"Building web applications with Python using the Django framework offers a robust and efficient solution for developers aiming to create dynamic and scalable websites. Django, an open-source web framework, follows the Model-View-Controller (MVC) architectural pattern, facilitating rapid development by emphasizing reusability and pluggability of components. The framework provides a plethora of built-in features, including an ORM (Object-Relational Mapping) system for database interactions, a powerful admin panel for easy content management, and a secure authentication system. Its URL routing mechanism enables clean and organized URL patterns, while its template system allows for the creation of dynamic and maintainable user interfaces. Additionally, Django's extensive documentation and strong community support make it an ideal choice for beginners and experienced developers alike. With Django, developers can streamline the development process, focusing more on implementing business logic rather than reinventing the wheel, ultimately resulting in faster delivery of high-quality web applications.",
        "price": 59.99,
        "duration": "8 weeks",
        "level": "Intermediate",
        "category": "Backend Development",
        "image": "https://cdn.educba.com/academy/wp-content/uploads/2017/10/Python-and-Django-for-Web-Development.jpg"
      },
      {
        "id": 3,
        "title": "Building RESTful APIs with Express",
        "instructor": "Alex Johnson",
        "description": "Learn to create RESTful APIs using the Express framework in Node.js",
        "details":"Creating RESTful APIs using the Express framework in Node.js is a fundamental skill for web developers looking to build scalable and efficient backend systems. Express, a lightweight and flexible Node.js web application framework, provides a robust set of features for building web and mobile applications. When creating RESTful APIs with Express, developers leverage its middleware system to handle requests, responses, and other functionalities like routing, error handling, and authentication. Express simplifies the process of handling HTTP requests by providing methods such as GET, POST, PUT, and DELETE to correspond with CRUD operations (Create, Read, Update, Delete). By defining routes and endpoints, developers can structure their APIs logically, making it easier to organize and manage different functionalities within the application. Additionally, Express allows for the integration of various middleware and third-party packages, enabling developers to extend the functionality of their APIs with features like data validation, logging, and security measures. Overall, mastering the creation of RESTful APIs with Express empowers developers to build robust and scalable backend systems that effectively serve data and resources to client applications.",
        "price": 39.99,
        "duration": "4 weeks",
        "level": "Beginner",
        "category": "Backend Development",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQrr3hjiD0eSUkbQ5YZjeNHDgnjPsqEzOL2Jg&usqp=CAU"
      },
      {
        "id": 4,
        "title": "MongoDB Essentials",
        "instructor": "Michael Brown",
        "description": "Introduction to MongoDB database management and querying",
        "details":"MongoDB is a popular, open-source NoSQL database management system designed to handle large volumes of data across distributed architectures. Unlike traditional relational databases, MongoDB stores data in flexible, JSON-like documents, making it highly scalable and adaptable to evolving data structures. Its flexible schema allows for seamless integration of diverse data types and enables developers to quickly iterate on application development without rigid schema constraints. MongoDB's query language is intuitive and powerful, offering a wide range of operations for data retrieval, manipulation, and aggregation. It supports dynamic queries, allowing users to search, filter, and sort data based on various criteria. Additionally, MongoDB provides robust indexing capabilities for efficient data access and supports geospatial queries for location-based applications. Its distributed architecture ensures high availability and fault tolerance, with built-in replication and automatic sharding for horizontal scaling. With its rich feature set, ease of use, and scalability, MongoDB is widely adopted across industries for building modern, data-driven applications.",
        "price": 29.99,
        "duration": "3 weeks",
        "level": "Beginner",
        "category": "Backend Development",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ3m0Hyu_gl4OVr2wyaWBih7uWEZlHipBEMKg&usqp=CAU"
      }
    ]
  }
  