{
    "courses": [
      {
        "id": 1,
        "title": "Java Programming Masterclass for Software Developers",
        "instructor": "Tim Buchalka",
        "description": "Learn Java In This Course And Become a Computer Programmer. Obtain valuable Core Java Skills And Java Certification",
        "details":"Embark on a transformative journey to master Java programming through our comprehensive course designed for aspiring computer programmers. Dive into the world of Java and unlock valuable core skills essential for today's tech-driven landscape. Whether you're a novice or seeking to enhance your expertise, this course offers a structured curriculum that covers key concepts, from basic syntax to advanced programming techniques. Our experienced instructors guide you through hands-on exercises, real-world projects, and engaging lectures to ensure a deep understanding of Java fundamentals. Upon completion, you'll not only possess the proficiency to develop robust Java applications but also earn a recognized Java certification, validating your expertise and opening doors to exciting career opportunities in software development and beyond.",
        "price": 49.99,
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQeXzVzIsYg946qzJ8aybeMmERbZhR8RnJlZA&usqp=CAU",
        "rating": 4.5,
        "studentsEnrolled": 5000,
        "level": "Intermediate",
        "duration": "40 hours"
      },
      {
        "id": 2,
        "title": "Complete Java Developer Bootcamp",
        "instructor": "John Doe",
        "description": "Become a Java Developer with this comprehensive course covering Java 11, JavaFX, and more.",
        "details":"Embark on a transformative journey into the world of Java development with our comprehensive course designed to equip you with the essential skills and knowledge needed to thrive in this dynamic field. Throughout this meticulously crafted program, you will delve deep into Java 11, the latest version of the programming language, mastering its syntax, principles, and best practices. From fundamental concepts to advanced techniques, you'll build a solid foundation that forms the bedrock of your Java expertise. But that's not all - our course goes beyond the basics, ensuring you're well-versed in JavaFX, the cutting-edge framework for building rich client applications. With hands-on projects, real-world examples, and expert guidance, you'll gain practical experience in developing robust Java applications and intuitive user interfaces. Whether you're a novice seeking to break into the industry or a seasoned developer aiming to stay ahead of the curve, this course is your definitive path to becoming a proficient Java developer ready to tackle any challenge with confidence and finesse. Join us and unlock the boundless opportunities that await in the realm of Java development.",
        "price": 79.99,
        "image": "https://technogeekscs.com/wp-content/uploads/2023/11/Java-training-institute-.jpg",
        "rating": 4.8,
        "studentsEnrolled": 3000,
        "level": "Advanced",
        "duration": "60 hours"
      },
      {
        "id": 3,
        "title": "Java Spring Framework Masterclass",
        "instructor": "Jane Smith",
        "description": "Learn the most popular Java framework and become a Spring Framework expert.",
        "details":"Becoming a Spring Framework expert entails delving into one of the most widely used Java frameworks in modern software development. Spring Framework provides comprehensive infrastructure support for developing Java applications, offering a robust, modular, and scalable platform for building enterprise-level systems. Aspiring experts embark on a journey to master various components of the framework, including Spring Core, which facilitates dependency injection and inversion of control, empowering developers to write loosely coupled and testable code. Additionally, expertise in Spring MVC enables proficient handling of web application development, while Spring Boot streamlines the process of creating stand-alone, production-grade Spring-based applications. A Spring Framework expert possesses in-depth knowledge of Spring Data for seamless integration with databases, Spring Security for implementing authentication and authorization mechanisms, and Spring Cloud for building resilient microservices architectures. Mastery of these components equips professionals with the skills needed to design, develop, and deploy robust Java applications efficiently. Furthermore, staying updated with the latest releases and best practices within the Spring ecosystem is integral to continuous growth and proficiency in this field. Overall, becoming a Spring Framework expert involves immersing oneself in its various modules, mastering its intricacies, and leveraging its capabilities to create high-performance, scalable Java applications tailored to meet diverse business requirements.",
        "price": 59.99,
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ0h_qL9pJB4XucG9xkPRh3PLQPWhWN5-Po9g&usqp=CAU",
        "rating": 4.7,
        "studentsEnrolled": 4000,
        "level": "Intermediate",
        "duration": "50 hours"
      }
    ]
  }
  